---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewActivatedEventArgs Properties
ViewActivatedEventArgs Class See Also Send Feedback
---

The ViewActivatedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | CurrentActiveView | The view that has just become active. |
|  | Document | The document associated with the event.  (Inherited from RevitAPIPostDocEventArgs.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | PreviousActiveView | The previously active view. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).  (Inherited from RevitAPIPostEventArgs.) |

# See Also

ViewActivatedEventArgs Class

Autodesk.Revit.UI.Events Namespace